driver-tests/bpelse/xslt/DoXslTransformBPEL/src/qualified/XslTransformQual.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions targetNamespace="http://j2ee.netbeans.org/wsdl/XslTransformQual"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/XslTransformQual" name="XslTransformQual" xmlns:ns="http://sun.com/EmplInputQual" xmlns:ns0="http://sun.com/EmplOutputQual" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/XslTransformQual">
            <xsd:import namespace="http://sun.com/EmplInputQual" schemaLocation="EmployeeInputQual.xsd"/>
            <xsd:import namespace="http://sun.com/EmplOutputQual" schemaLocation="EmployeeOutputQual.xsd"/>
        </xsd:schema>
    </types>
    <message name="XslTransformQualOperationRequest">
        <part name="part1" element="ns:EmployeeInput"/>
    </message>
    <message name="XslTransformQualOperationReply">
        <part name="part1" element="ns0:EmployeeOutput"/>
    </message>
    <portType name="XslTransformQualPortType">
        <wsdl:operation name="XslTransformQualOperation">
            <wsdl:input name="input1" message="tns:XslTransformQualOperationRequest"/>
            <wsdl:output name="output1" message="tns:XslTransformQualOperationReply"/>
        </wsdl:operation>
    </portType>
    <binding name="XslTransformQualBinding" type="tns:XslTransformQualPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="XslTransformQualOperation">
            <soap:operation/>
            <wsdl:input name="input1">
                <soap:body use="literal"/>
            </wsdl:input>
            <wsdl:output name="output1">
                <soap:body use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </binding>
    <service name="XslTransformQualService">
        <wsdl:port name="XslTransformQualPort" binding="tns:XslTransformQualBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/XslTransformQualService/XslTransformQualPort"/>
        </wsdl:port>
    </service>
    <plnk:partnerLinkType name="XslTransformQualPartner">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="XslTransformQualPortTypeRole" portType="tns:XslTransformQualPortType"/>
    </plnk:partnerLinkType>
</definitions>
