driver-tests/bpelse/xslt/DoXslTransformJBI/test/qualified1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:emp="http://sun.com/EmplInputQual">
  <soapenv:Body>
    <emp:EmployeeInput>
      <emp:EmployeeNumber>123</emp:EmployeeNumber>
      <emp:LastName>Smith</emp:LastName>
      <emp:FirstName>Bob</emp:FirstName>
      <emp:JobTitle>Code Monkey</emp:JobTitle>
      <emp:HoursWorked>60</emp:HoursWorked>
      <emp:PayRate>50</emp:PayRate>
    </emp:EmployeeInput>
  </soapenv:Body>
</soapenv:Envelope>